EA/src/InformationRegisters/ШаблоныФайловОбменаКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ШаблоныФайловОбменаКонтрагентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ШаблонФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныФайловОбмена</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидИмпортируемыхДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИмпортируемыхДанных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

EA/src/InformationRegisters/ШаблоныФайловОбменаКонтрагентов/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Функция ШаблонФайлаОбменаКонтрагента(Контрагент, ВидИмпортируемыхДанных) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.ШаблоныФайловОбменаКонтрагентов.СоздатьМенеджерЗаписи();
	Запись.Контрагент = Контрагент;
	Запись.ВидИмпортируемыхДанных = ВидИмпортируемыхДанных;
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		Возврат Запись.ШаблонФайла;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ШаблоныФайловОбменаКонтрагента(Контрагент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШаблоныФайловОбменаКонтрагентов.ВидИмпортируемыхДанных КАК ВидИмпортируемыхДанных,
	|	ШаблоныФайловОбменаКонтрагентов.ШаблонФайла КАК ШаблонФайла
	|ИЗ
	|	РегистрСведений.ШаблоныФайловОбменаКонтрагентов КАК ШаблоныФайловОбменаКонтрагентов
	|ГДЕ
	|	ШаблоныФайловОбменаКонтрагентов.Контрагент = &Контрагент";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ВидИмпортируемыхДанных, Выборка.ШаблонФайла);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
